<?php
// +----------------------------------------------------------------------
// | 小程序注册服务商助手 
// +----------------------------------------------------------------------
// | 版权所有  晓江云计算有限公司 
// +----------------------------------------------------------------------
// | 官方网站：https://www.xiaojiangy.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | 联系方式: 13163426222 <sc@xiaojiany.com>
// +----------------------------------------------------------------------
// | 系统已获取您的域名和ip信息，本系统未经授权严禁使用，盗版必究。
// +----------------------------------------------------------------------
// | 公司决定2023年1月份对所有盗版用户进行维权诉讼，避免更大损失，请尽早转正。
// +----------------------------------------------------------------------

return [
    //主体类别
    'subject_type' => [
        'SUBJECT_TYPE_INDIVIDUAL' => '个体户',
        'SUBJECT_TYPE_ENTERPRISE' => '企业',
    ],

    //账户类型
    'bank_account_type' => [
        'BANK_ACCOUNT_TYPE_CORPORATE' => '对公银行账户',
        'BANK_ACCOUNT_TYPE_PERSONAL' => '经营者个人银行卡',
    ],

    //经营场所
    'sales_scenes_type' => [
        'SALES_SCENES_STORE' => '线下门店',
        'SALES_SCENES_MP' => '公众号',
    ],
    //个人行业分类
    'persion_trad' => [
        '719' => '其他(0.6%,T+1)',
        '720' => '话费通讯(0.6%,T+1)',
        '746' => '游戏/网络广告/软件开发(1%,T+1)',
        '721' => '加油(0.3%,T+1)',
    ],
    //企业行业分类
    'company_trad' => [
        '739' => '民办大学及院校',
        '718' => '信用卡还款',
        '730' => '公共事业（水电煤气）',
        '717' => '物流/快递,加油,民办中小学及幼儿园',
        '711' => '在线图书/视频/音乐/网络直播,游戏,门户论坛/网络广告及推广/软件开发/其他',
        '713' => '财经/股票类资讯',
        '714' => '众筹',
        '715' => '保险业务',
        '716' => '其他',
    ],
    //开户银行
    'account_banks' => [
        '工商银行',
        '交通银行',
        '招商银行',
        '民生银行',
        '中信银行',
        '浦发银行',
        '兴业银行',
        '光大银行',
        '广发银行',
        '平安银行',
        '北京银行',
        '华夏银行',
        '农业银行',
        '建设银行',
        '邮政储蓄银行',
        '中国银行',
        '宁波银行',
        '农商银行',
        '其他银行',
    ],


];
