<?php
// +----------------------------------------------------------------------
// | 小程序注册服务商助手 
// +----------------------------------------------------------------------
// | 版权所有  晓江云计算有限公司 
// +----------------------------------------------------------------------
// | 官方网站：https://www.xiaojiangy.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | 联系方式: 13163426222 <sc@xiaojiany.com>
// +----------------------------------------------------------------------
// | 系统已获取您的域名和ip信息，本系统未经授权严禁使用，盗版必究。
// +----------------------------------------------------------------------
// | 公司决定2023年1月份对所有盗版用户进行维权诉讼，避免更大损失，请尽早转正。
// +----------------------------------------------------------------------
return
    [
        '0' => 'ok，小程序创建成功',
        '3' => 'overdue unconfirmed，用户超时未确认',
        '-1' => '小程序创建失败，系统错误 系统繁忙，此时请开发者稍候再试',
        '750001' => '申请者微信与确认授权者微信不是同一个用户',
        '750004' => 'create_token不合法，即 token 里包含的身份和实际使用时的身份不一样',
        '750011' => '获取权限集列表失败，请检查该第三方的权限集是否已全网发布生效后，再重试。',
        '750002' => '小程序授权给第三方失败，请检查该第三方的权限集是否已全网发布生效后，再重试。',
        '-2000001' => '平台系统内部错误，请到社区反馈',
        '-2000002' => '平台系统内部错误，请到社区反馈',
        '-2000003' => '同一个票据不支持重复创建小程序',
        '40001' => '获取 access_token 时 AppSecret 错误，或者 access_token 无效。请开发者认真比对 AppSecret 的正确性，或查看是否正在为恰当的公众号调用接口',
        '86011' => '请更换名字后重试。',
        '86012' => 'openid不合法',
        '61071' => '该微信用户创建试用小程序已经5个，达到上限',
        '61072' => '该微信号错误或者为不活跃低信用户，通常为微信小号，请更换为正常的微信号后重试。',
        '86017' => '试用小程序名称长度错误。只支持4-30个字符（不包含的试用小程序这六个汉字的占用）',
    ];
