<?php
// +----------------------------------------------------------------------
// | 小程序注册服务商助手 
// +----------------------------------------------------------------------
// | 版权所有  晓江云计算有限公司 
// +----------------------------------------------------------------------
// | 官方网站：https://www.xiaojiangy.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | 联系方式: 13163426222 <sc@xiaojiany.com>
// +----------------------------------------------------------------------
// | 系统已获取您的域名和ip信息，本系统未经授权严禁使用，盗版必究。
// +----------------------------------------------------------------------
// | 公司决定2023年1月份对所有盗版用户进行维权诉讼，避免更大损失，请尽早转正。
// +----------------------------------------------------------------------
return
    [
        '41001' => '缺少 access_token 参数',
        '53010' => '名称格式不合法',
        '53011' => '名称检测命中频率限制',
        '53012' => '禁止使用该名称',
        '53013' => '公众号：名称与已有公众号名称重复;小程序：该名称与已有小程序名称重复',
        '53014' => '公众号：公众号已有{名称 A+}时，需与该帐号相同主体才可申请{名称 A};小程序：小程序已有{名称 A+}时，需与该帐号相同主体才可申请{名称 A}',
        '53015' => '公众号：该名称与已有小程序名称重复，需与该小程序帐号相同主体才可申请;小程序：该名称与已有公众号名称重复，需与该公众号帐号相同主体才可申请',
        '53016' => '公众号：该名称与已有多个小程序名称重复，暂不支持申请;小程序：该名称与已有多个公众号名称重复，暂不支持申请',
        '53017' => '公众号：小程序已有{名称 A+}时，需与该帐号相同主体才可申请{名称 A};小程序：公众号已有{名称 A+}时，需与该帐号相同主体才可申请{名称 A}',
        '53018' => '名称命中微信号',
        '53019' => '名称在保护期内',
        '86030' => '提交的json数据缺少需要的参数',
        '86031' => '第三方号无效或未全网发布',
        '86032' => '微信id无效',
        '86033' => '第三方号的权限集缺失',
        '86036' => '姓名与微信号不一致',
        '89249' => '该主体已有任务执行中，距上次任务 24h 后再试',
        '89247' => '内部错误',
        '86004' => '无效微信号',
        '61070' => '法人姓名与微信号不一致',
        '89248' => '企业代码类型无效，请选择正确类型填写',
        '89250' => '未找到该任务',
        '89251' => '待法人人脸核身校验',
        '89252' => '法人&企业信息一致性校验中',
        '89253' => '缺少参数',
        '89254' => '第三方权限集不全，请补充权限集后重试',
        '89255' => 'code参数无效，请检查code长度以及内容是否正确 ；注意code_type的值不同需要传的code长度不一样',
        '48001' => 'api 功能未授权'
    ];
